/**
 * Created by px on 2016/8/18 0018.
 */
export default $app
        .constant("UC_REGEXP", {
            // 直接使用ng-pattern="/^1[34578]\d{9}$/"没问题   但使用ng-pattern="{{SiteRegExp.tel}}"时 必须"/^1[34578]\\d{9}$/"

            MOBILE_CN: "^(0|86|17951)?(13[0-9]|15[012356789]|17[0678]|18[0-9]|14[57])[0-9]{8}$", // 中国手机号

            EMAIL: "^[a-zA-Z0-9](\\w|\\.|-)*@([a-zA-Z0-9]{2,}-?\\.){1,2}[a-zA-Z]{2,3}$", // 邮箱

            TEL_OR_EMAIL: "(^(0|86|17951)?(13[0-9]|15[012356789]|17[0678]|18[0-9]|14[57])[0-9]{8}$)|(^[a-zA-Z0-9](\\w|\\.|-)*@([a-zA-Z0-9]{2,}-?\\.){1,2}[a-zA-Z]{2,3}$)", // 手机号/邮箱

            PASSWORD: "^(?![0-9]+$)(?![A-Za-z]+$)(?![-~!@#\\$￥%^&*_\\(\\)\\{\\};:+|,.\\?\\/\\[\\]\\'\"]+$)[-~!@#\\$￥%^&*_\\(\\)\\{\\};:+|,.\\?\\/\\[\\]\\'\"A-Za-z0-9]{8,32}$", // 8~16个字符，必须包含字母和数字，区分大小写。

            REAL_NAME: "^[a-zA-Z0-9\u4e00-\u9fa5_ ]{2,20}$" //用户真实姓名2-20位

        })
        .constant("UC_EMAIL_DOMAIN_DATA",
            ["@163.com", "@qq.com", "@126.com", "@gmail.com", "@sina.com", "@sohu.com", "@21cn.com", "@yeah.net", "@hotmail.com", "@yahoo.com"])
